evaluation/openfire/tsung-chatonly.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="info">
  <clients>
	<client host="localhost" use_controller_vm="true"/>
  </clients>
  <servers>
	<server host="localhost" port="5222" type="tcp"></server>
  </servers>
  <load>
	<arrivalphase phase="1" duration="5" unit="minute">
      <users interarrival="0.1" unit="second"></users>
	</arrivalphase>
  </load>
  <options>
	<option type="ts_jabber" name="userid_max" value="10000"/>
	<option type="ts_jabber" name="username" value="testuser"/>
	<option type="ts_jabber" name="passwd" value="testpassword"/>
	<option type="ts_jabber" name="domain" value="staccato"/>
  </options>
  <sessions>
	<session probability="100" name="jabber-test" type="ts_jabber">
      <request> <jabber type="connect" ack="local" /> </request>
	  
      <thinktime value="2"></thinktime>

      <transaction name="authenticate">
		<request> <jabber type="auth_get" ack="local"></jabber> </request>
		<request> <jabber type="auth_set_plain" ack="local"></jabber> </request>
      </transaction>


      <request> <jabber type="presence:initial" ack="no_ack"/> </request>
	  
      <thinktime value="5"></thinktime>
	  
      <transaction name="online">
		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
      </transaction>

      <thinktime value="5"></thinktime>

      <transaction name="chatburst">
		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
      </transaction>

      <thinktime value="1"></thinktime>

      <transaction name="close">
		<request> <jabber type="close" ack="local"> </jabber></request>
      </transaction>
	</session>
  </sessions>
</tsung>